configs/runs/hidden_bench/hidden_bench_vanilla_full_all_tasks_copy.yaml
# HiddenBench, vanilla game, `profile: full` swept over every task in the
# canonical corpus (all 65 upstream tasks).
#
# WHAT THIS ANSWERS: "given the whole of Iu (every fact, not just the agent's
# own slice), can the agent pick the correct answer?" That is Y_full - the
# paper's ceiling condition (§1.2) - and `profile: full` with `rounds: 0` is
# how this game measures it: every agent starts holding all information, so
# the pre-vote *is* the post-vote and no discussion is needed
# (src/mas_cc/games/hidden_bench/vanilla/game.py's module docstring). There is
# deliberately no `hidden` cell in this file - that is
# hidden_bench_vanilla_hidden_all_tasks.yaml, the paired "as intended" run
# where each agent sees only its own private slice.
#
# `assignment_scheme: exact_replication` (not `bijective`) because the corpus
# mixes N_native=3 and N_native=4 tasks (58 at 4, 7 at 3 -
# scripts/local_llms/hiddenbench_population_pipeline/data/hiddenbench/canonical/tasks.json);
# bijective demands n_agents == the task's own native count, which breaks the
# moment a fixed `population_size: 4` hits a 3-agent task. exact_replication
# has no such constraint (it pads/duplicates evidence-type labels to reach N)
# and is what src/mas_cc/games/hidden_bench/data.py::assign already does for
# N > native without a prebuilt file - the union invariant still holds either
# way. For `profile: full` the assignment scheme is not even read (every agent
# gets everything regardless), so this only matters for consistency with the
# paired hidden-profile file.
#
# COST: 8 calls/episode (N pre-votes + N post-votes, no discussion) x <=3
# (invalid_response_retries: 2, worst case) = 24/episode per task in the grid
# below - it prices the exact grid from call_plan, not this comment.
#
# RUN THIS FROM A TERMINAL. First enter the repository (change this path if
# your checkout lives somewhere else):
#   cd /home/cesarali/LanguageGames/MA-CC
#
# The commands below use the MA-CC Conda environment without requiring you to
# activate it. `--no-capture-output` keeps logs, progress bars, provider
# errors, and the final result path visible while the command runs. Make sure
# the repository-root .env contains POTSDAM_API_KEY and BASE_POTSDAM_LLM_URL
# before launching.
#
# 1. Check availability, pricing, request counts, and budget (no model calls):
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment preflight \
#     --config configs/runs/hidden_bench/hidden_bench_vanilla_full_all_tasks_copy.yaml \
#     --output-dir inspection/hidden_bench_vanilla_full_all_tasks_copy_preflight
#
# 2. Run every cell in the grid below with live console output:
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment run \
#     --config configs/runs/hidden_bench/hidden_bench_vanilla_full_all_tasks_copy.yaml \
#     --output-dir results
#
# The run performs its own fresh pricing and runtime-budget checks.
llm_provider:
  type: university
  model: gwdg/qwen3-30b-a3b-instruct-2507
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  timeout_seconds: 60
  max_retries: 2
  request_concurrency: 8
  temperature: 0.0
  max_output_tokens: 512
  options:
    estimated_latency_seconds: 3.0
prompt:
  schema_version: 2
  prompt_family: hidden_bench_vote
  prompt_version: 1
  message_mode: merge_consecutive_roles
  block_separator: "\n\n"
  response_contract:
    type: hidden_bench_json_vote
    # Cosmetic only: the vote's real allowed_values are bound per-task at run
    # time from each task's own possible_answers (vanilla/game.py), not from
    # this field. Left here only because schema_version: 2 still requires the
    # section to be present with a `type`.
    allowed_values: [Option A, Option B, Option C]
game:
  type: hidden_bench_vanilla
  population_size: 4
  # Not used by this game (see hidden_bench_vanilla.yaml); set to the derived
  # total for readability. profile: full, rounds: 0 => 1 pre-vote + 1
  # post-vote = 2 interactions, 8 provider calls.
  horizon: 8
  topology: complete
  options:
    task_set: vanilla
    # task_id is swept below, across all 65 canonical tasks.
    # n_agents is deliberately unset: it defaults to game.population_size.
    profile: full
    assignment_scheme: exact_replication
    rounds: 0
    rounds_are_speaking_turns: false
    extra_prompt: null
    dissenter_extra_prompt: null
    dissenter_fraction: 0.0
    aggregation: average
    shuffle_facts: true
    decoy: null
    invalid_response_retries: 2
    expected_validation_failure_rate: 0.0
control:
  mechanism: none
execution:
  seed: 20260811
  repetitions: 1 # episodes PER CELL; raise once the pilot run looks right
  parallelism: 4
  fail_fast: false
pricing:
  mode: live
  max_age_seconds: 600
  require_fresh_at_launch: true
  fallback_policy: deny
  explicit_unknown_price_override: false
budget:
  # Sized for the whole grid (65 cells x 1 repetition), not one cell - see the
  # COST note above. Re-check with `experiment preflight` before raising
  # `repetitions`.
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 15.0
  max_cost_per_run: 15.0
  max_provider_requests: 1600
  max_input_tokens: 600000
  max_output_tokens: 120000
  allow_unbounded_paid_requests: false
logging:
  level: INFO
  console: true
  audit: true
  comet: false
  options:
    prompt_examples:
      count: 1
storage:
  output_dir: results
  format: jsonl
  checkpoints: true
  overwrite: false
analysis:
  enabled: false
  estimators: []
metrics:
  enabled: true
  available:
    population_action_share_per_option:
      comet: true
    dominant_action_share:
      comet: true
    accuracy_average:
      comet: true
    accuracy_majority:
      comet: true
    decoy_share:
      comet: true
    unshared_disclosure_rate:
      comet: true
    first_consensus_time_by_action_share:
      comet: false
    y_pre:
      comet: true
    y_post:
      comet: true
    improvement:
      comet: true
    final_unshared_disclosure_rate:
      comet: true
    agent_current_action:
      comet: false
experiment:
  name: hidden-bench-vanilla-full-profile-all-tasks
  description: >-
    Y_full ceiling check: every agent holds the whole of Iu (profile: full,
    rounds: 0), swept over all 65 canonical HiddenBench tasks. Answers "can
    the agent get it right when given everything?" Paired with
    hidden_bench_vanilla_hidden_all_tasks.yaml (profile: hidden) for the
    paper's actual asymmetric-information condition.
  tags: [hidden-bench, vanilla, full-profile, all-tasks, y-full]
grid:
  game.options.task_id:
    - "evacuation_west_city"
    - "evacuation_north_hill"
    - "evacuation_east_town"
    - "toma_butera_2009"